"""
Напишите программу не более чем в две строки, которая
запрашивает число, и выводит 0, если число четное;и 1, если число нечетное.
Инструкцию условного оператора не использовать.
"""
x = int(input()) % 2
print(x)
