"""
Напишите программу для вывода заданного количества зайцев.
Между зайцами используется один пробел. Оператор цикла использовать не нужно.
"""
i = int(input())

print('(\\___/) ' * i)
print("(='.'=) " * i)
print('(")_(") ' * i)
